app/controllers/main_controller.rb

SELECT * FROM "messages" WHERE (messageTopic = messageTopic)
SELECT * FROM "topics" WHERE (id = 4) LIMIT 1
---
	def index
		@title ="MICROCOSM"
		@messages = Message.all
		@topics = Topic.all

SELECT * FROM "users" WHERE ("users"."userName" = 'michael' AND "users"."userPassword" = 'password')
SELECT * FROM "users" WHERE ("users"."userPassword" = 'password') LIMIT 1
---
	def login
		#	gets the userName and userPassword from the login Partial and validates them
		#	then changes the main view from using the login Partial to the loggedin Partial

		@user = User.new(params[:user])

		#validates the user against the database of users
		validUser = User.find_by_userName_and_userPassword(@user.userName, @user.userPassword)

		if validUser
			#creates a session with username
			session[:id]=validUser.id
			$userName = validUser.firstName + " " + validUser.lastName