app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT * FROM "messages"

  def show
    @message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1)

  def edit
    @message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1)

  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("messageTopic", "created_at", "messageBody", "updated_at", "messageCreator", "messageTime") VALUES(0, '2010-08-30 23:15:56', 'testing math class', '2010-08-30 23:15:56', 'michael', '2010-08-30 23:15:00')

  def update
    @message = Message.find(params[:id])

    respond_to do |format|
      if @message.update_attributes(params[:message])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1)
UPDATE "messages" SET "updated_at" = '2010-08-31 23:50:46', "messageTopic" = 4, "messageTime" = '2010-08-31 23:42:00' WHERE "id" = 19

  def destroy
    @message = Message.find(params[:id])
    @message.destroy
---
SELECT * FROM "messages" WHERE ("messages"."id" = 3)
DELETE FROM "messages" WHERE "id" = 3