app/controllers/topics_controller.rb

SELECT * FROM "topics"
---
  def index
    @topics = Topic.all

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
---
  def show
    @topic = Topic.find(params[:id])

INSERT INTO "messages" ("messageTopic", "created_at", "messageBody", "updated_at", "messageCreator", "messageTime") VALUES(NULL, '2010-08-31 19:12:36', NULL, '2010-08-31 19:12:36', 'michael mcguire', '2010-08-31 19:12:35')
INSERT INTO "topics" ("created_at", "topicType", "updated_at", "topicName") VALUES('2010-08-29 02:09:06', 'general', '2010-08-29 02:09:06', 'new dishwasher')
---
  def create
    @topic = Topic.new(params[:topic])
    @message = @topic.messages.build(params[:message])

    if @topic.save

SELECT * FROM "topics" WHERE ("topics"."id" = 3)
DELETE FROM "topics" WHERE "id" = 3
---
  def destroy
    @topic = Topic.find(params[:id])
    @topic.destroy