app/controllers/users_controller.rb

 def create
    @user = User.new(params[:user])
	if @user.save
		validUser = User.find_by_userName_and_userPassword(@user.userName, @user.userPassword)
---
INSERT INTO "users" ("userName", "lastName", "created_at", "updated_at", "userType", "userId", "firstName", "userPassword", "userEmail") VALUES('admin', 'mcguire', '2010-08-15 19:11:46', '2010-08-15 19:11:46', 'admin', '5853', 'michael', 'ctec290', 'mmcgu1966@gmail.com')
SELECT * FROM "users" WHERE ("users"."userName" = 'cthulhu' AND "users"."userPassword" = 'password') LIMIT 1